ERP DEV.WMS/src/DataProcessors/СборкаПаллетПоДокументу/СборкаПаллетПоДокументу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СборкаПаллетПоДокументу</name>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/Documents/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ОперацияПоЯчейкам</name>
  <registerRecords>InformationRegister.вмс_ИсторияИерархииКонтейнеров</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОстаткиВКонтейнерах</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ЗаданияКладовщикам</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОперацияПоЯчейкам</registerRecords>
  <registerRecords>InformationRegister.вмс_МестоположенияКонтейнеров</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Готов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактированиеИерархии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаСУпаковками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучныеИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСубОперации</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщику</name>
    <type>
      <types>DocumentRef.вмс_ЗаданиеКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <comment>Должен быть составной тип, чтобы вести серии, если типовые отключены</comment>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаТранзит</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПриемник</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриравнятьКоличество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <comment>Может хранить номер строки таблицы инвентаризации, чтобы ссылаться на нее в случае ошибки проведения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПересчетКонтейнераРодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоИнвентаризации</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИерархияКонтейнеров</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерРасход</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриход</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АгрегацияКонтейнеров</name>
    <comment>Используется для сборки\разборки товаров в контейнеры</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <comment>Хранит фактически отсканированную маркировку товара</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйКодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <comment>Партионный учет</comment>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/DataProcessors/СборкаПаллетПоДокументу/Forms/Форма/Module.bsl
&НаСервере
Процедура РаспоряжениеПриИзмененииНаСервере()
		
	ТаблицаТоваров.Очистить();	
	ТаблицаТоваров.Загрузить(Объект.Распоряжение.Товары.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура РаспоряжениеПриИзменении(Элемент)
	РаспоряжениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПаллетПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если Не ЗначениеЗаполнено(ТекущаяПаллета) Тогда
		//TODO: Выбор паллеты если не указана
		// 		Кнопка "Новая паллета
		ТекущаяПаллета = ТекущаяПаллета + 1;
		ПоследняяПаллета = ТекущаяПаллета;
		ПодключитьОбработчикОжидания("АнимацияТекущаяПаллета",0.1,Истина);
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(ДатаПаллеты) Тогда  
		
		Оповещение = Новый ОписаниеОповещения("ТаблицаПаллетПеретаскиваниеПродолжение",ЭтотОбъект,ПараметрыПеретаскивания);
		ПоказатьВводДаты(Оповещение,ДатаПаллеты,"Укажите дату");
		Возврат;
			
	КонецЕсли;	
		
	Для каждого пСтрока Из ПараметрыПеретаскивания.Значение Цикл 
		
		Количество = Неопределено;
		Оповещение = Новый ОписаниеОповещения("ТаблицаПаллетПеретаскиваниеЗавершение",ЭтаФорма,Новый Структура("СтрокаТовара",пСтрока));  
		
		ПараметрыОткрытия = Новый Структура("Номенклатура,Количество",);
		ЗаполнитьЗначенияСвойств(ПараметрыОткрытия,пСтрока);	
		ОткрытьФорму("Обработка.СборкаПаллетПоДокументу.Форма.ФормаВводаКоличества",ПараметрыОткрытия,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		//ПоказатьВводЧисла(Оповещение,пСтрока.Количество,"Сколько товара " + Символы.ПС + """" + пСтрока.Номенклатура + """ (" + пСтрока.Количество + ") взять"); 
				
	КонецЦикла; 	

КонецПроцедуры 

&НаКлиенте
Функция ТаблицаПаллетПеретаскиваниеПродолжение(пДата,ПараметрыПеретаскивания) Экспорт
	
	Если ЗначениеЗаполнено(пДата) Тогда
		
		ДатаПаллеты = пДата;
		
		Для каждого пСтрока Из ПараметрыПеретаскивания.Значение Цикл 
			
			Количество = Неопределено;
			Оповещение = Новый ОписаниеОповещения("ТаблицаПаллетПеретаскиваниеЗавершение",ЭтаФорма,Новый Структура("СтрокаТовара",пСтрока));  
			
			ПараметрыОткрытия = Новый Структура("Номенклатура,Количество",);
			ЗаполнитьЗначенияСвойств(ПараметрыОткрытия,пСтрока);	
			ОткрытьФорму("Обработка.СборкаПаллетПоДокументу.Форма.ФормаВводаКоличества",ПараметрыОткрытия,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			//ПоказатьВводЧисла(Оповещение,пСтрока.Количество,"Сколько товара " + Символы.ПС + """" + пСтрока.Номенклатура + """ (" + пСтрока.Количество + ") взять"); 
			
		КонецЦикла; 	
		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Функция ТаблицаПаллетПеретаскиваниеЗавершение(Результат,Параметры) Экспорт  
	
пСтрока = Параметры.СтрокаТовара; 
	
	Если Результат = Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	КоличествоТовара = Результат.Количество;
	
	Если ЗначениеЗаполнено(КоличествоТовара) Тогда 
		
		Если пСтрока.Количество < КоличествоТовара Тогда
			ВызватьИсключение "Превышено количество отбираемого товара";
			Возврат Неопределено;
		КонецЕсли;
		
		нСтр = ТаблицаПаллет.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,пСтрока);
		нСтр.Количество = КоличествоТовара; 
		нСтр.Паллета = ТекущаяПаллета; 
		нСтр.ДатаПаллеты = ДатаПаллеты;
			
		пСтрока.Количество = пСтрока.Количество - КоличествоТовара;
		Если пСтрока.Количество = 0 Тогда
			ТаблицаТоваров.Удалить(пСтрока);
		КонецЕсли;
		
	КонецЕсли; 
	

	СвернутьТаблицуПаллет();
	
КонецФункции // ТаблицаПаллетПеретаскиваниеЗавершение()

&НаСервере
Функция СвернутьТаблицуПаллет()
	
	ТЗ = ТаблицаПаллет.Выгрузить();
	ТЗ.Свернуть("Номенклатура,Паллета,ДатаПаллеты","Количество");
	ТЗ.Сортировать("Паллета");
	ТаблицаПаллет.Загрузить(ТЗ);	
	
КонецФункции // СвернутьТаблицуПаллет()

&НаСервере
Функция СвернутьТаблицуТоваров()
	
	ТЗ = ТаблицаТоваров.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество");
	ТаблицаТоваров.Загрузить(ТЗ);	
	
КонецФункции // СвернутьТаблицуПаллет()

&НаКлиенте
Процедура НоваяПаллета(Команда)
	ТекущаяПаллета = ПоследняяПаллета + 1;  
	ПоследняяПаллета = ТекущаяПаллета; 
	ПодключитьОбработчикОжидания("АнимацияТекущаяПаллета",0.1,Истина);
	
	Оповещение = Новый ОписаниеОповещения("НоваяПаллетаПродолжение",ЭтотОбъект);
	ПоказатьВводДаты(Оповещение,ДатаПаллеты,"Укажите дату");
	
КонецПроцедуры  

&НаКлиенте
Функция НоваяПаллетаПродолжение(Дата,дПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Дата) Тогда 		
		ДатаПаллеты = Дата;	
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Функция АнимацияТекущаяПаллета() Экспорт
	
	Если ЖирныйШрифт Тогда  		
		Элементы.Надписи.ТекущаяСтраница = Элементы.ОбычнаяНадпись;
		//Элементы.ТекущаяПаллета.Шрифт = Новый Шрифт(,,Ложь);
		ЖирныйШрифт = Ложь;
	Иначе   
		Элементы.Надписи.ТекущаяСтраница = Элементы.ЖирнаяНадпись;
		//Элементы.ТекущаяПаллета.Шрифт = Новый Шрифт(,,Истина);
		ЖирныйШрифт = Истина;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("АнимацияТекущаяПаллета",0.3,Истина);
  
КонецФункции // АнимацияТекущаяПаллета()

&НаКлиенте
Процедура ТаблицаТоваровПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	
	Для каждого пСтрока Из ПараметрыПеретаскивания.Значение Цикл 
		
		Количество = Неопределено;
		Оповещение = Новый ОписаниеОповещения("ТаблицаТоваровПеретаскиваниеЗавершение",ЭтаФорма,Новый Структура("СтрокаПаллет",пСтрока));  
		
		ПараметрыОткрытия = Новый Структура("Номенклатура,Количество",);
		ЗаполнитьЗначенияСвойств(ПараметрыОткрытия,пСтрока);	
		ОткрытьФорму("Обработка.СборкаПаллетПоДокументу.Форма.ФормаВводаКоличества",ПараметрыОткрытия,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		//ПоказатьВводЗначения(Оповещение,пСтрока.Количество,"Сколько товара " + Символы.ПС + """" + пСтрока.Номенклатура + """ (" + пСтрока.Количество + ") убрать",Тип("Число")); 
		
	КонецЦикла; 

КонецПроцедуры   

&НаКлиенте
Функция ТаблицаТоваровПеретаскиваниеЗавершение(Результат,Параметры) Экспорт  
	
	пСтрока = Параметры.СтрокаПаллет; 
	
	Если Результат = Неопределено Тогда Возврат Неопределено КонецЕсли;
	
	КоличествоТовара = Результат.Количество;
	
	Если ЗначениеЗаполнено(КоличествоТовара) Тогда 
		
		Если пСтрока.Количество < КоличествоТовара Тогда
			ТаблицаПаллет.Удалить(пСтрока); 
			Возврат Неопределено;
		КонецЕсли;
		
		нСтр = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,пСтрока);
		нСтр.Количество = КоличествоТовара;
		//нСтр.ДатаПаллеты = ДатаПаллеты;
		
		пСтрока.Количество = пСтрока.Количество - КоличествоТовара;
		Если пСтрока.Количество = 0 Тогда
			ТаблицаПаллет.Удалить(пСтрока);
		КонецЕсли;
		
	КонецЕсли; 
	
	СвернутьТаблицуТоваров();
	
КонецФункции // ТаблицаПаллетПеретаскиваниеЗавершение()

&НаКлиенте
Процедура СменитьПаллету(Команда)
	
	Если ПоследняяПаллета = 1 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пока использована только 1 паллета. Переключиться невозможно.";
		Сообщение.Сообщить();                                                           
		Возврат;
	КонецЕсли;
	
	СЗ = Новый СписокЗначений;
	Для Счетчик = 1 По ПоследняяПаллета Цикл 
		СЗ.Добавить(Счетчик,"Паллета №" + Счетчик);
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("СменитьПаллетуЗавершение",ЭтаФорма);
	ПоказатьВыборИзСписка(Оповещение,СЗ);
	
КонецПроцедуры  

&НаКлиенте
Функция СменитьПаллетуЗавершение(ВыбранныйЭлемент,пПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТекущаяПаллета = ВыбранныйЭлемент.Значение; 
		
		Оповещение = Новый ОписаниеОповещения("НоваяПаллетаПродолжение",ЭтотОбъект);
		ПоказатьВводДаты(Оповещение,ДатаПаллеты,"Укажите дату");
		
	КонецЕсли;
	
КонецФункции // СменитьПаллетуЗавершение()

&НаСервере
Функция ЗавершитьСборкуПаллетНаСервере(ТипПартии)  

	СтрокиПаллет = ТаблицаПаллет.Выгрузить();
	СтрокиПаллет.Свернуть("Паллета,ДатаПаллеты");  	
	МенеджерТары = Справочники.вмс_Контейнеры;
	МассивПартий = Новый Массив;
	
	
	ДокументДвижения = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ДокументДвижения.Заполнить(Неопределено);
	ДокументДвижения.Дата = ТекущаяДата();  
	ДокументДвижения.Готов = Истина;
	ДокументДвижения.Ответственный = Пользователи.ТекущийПользователь();
	ДокументДвижения.Комментарий = "#Сборка тары"; 
	ДокументДвижения.ДокументОснование = Параметры.ПараметрКоманды;
	
	Для каждого СтрокаПаллеты Из СтрокиПаллет Цикл  
		
		пДата = Параметры.ПараметрКоманды.Дата;
		
		НоваяТара = Справочники.вмс_Контейнеры.СоздатьЭлемент();
		НоваяТара.Штрихкод = МенеджерТары.ПолучитьНовыйНомерТары(ТипПартии);
		НоваяТара.ТипТары  = ТипПартии;
		НоваяТара.ДатаПартии = СтрокаПаллеты.ДатаПаллеты;
		НоваяТара.Наименование = ТипПартии.Префикс + Формат(пДата, "ДФ=ddMMyy_HHmmss") + "_#" + СтрокаПаллеты.Паллета + "_" + Формат(ТекущаяДата(), "ДФ=ddMMyy/HHmmss");
		НоваяТара.Записать();
		
		МассивПартий.Добавить(НоваяТара.Ссылка);
		
		МассивСтрок = ТаблицаПаллет.НайтиСтроки(Новый Структура("Паллета",СтрокаПаллеты.Паллета));
		
		Для каждого пСтрока Из МассивСтрок Цикл 
			
			нСтр = ДокументДвижения.Товары.Добавить();
			нСтр.Товар = пСтрока.Номенклатура;
			нСтр.Количество = пСтрока.Количество;
			нСтр.КонтейнерПриемник = НоваяТара.Ссылка; 			
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументДвижения.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат МассивПартий;	
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьСборкуПаллет(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьСборкуПаллетПродолжение",ЭтаФорма);
	ПоказатьВводЗначения(Оповещение,,"Выберите тип паллеты",Тип("ПланВидовХарактеристикСсылка.ТипыКонтейнеров"));
	
КонецПроцедуры

&НаКлиенте
Функция ЗавершитьСборкуПаллетПродолжение(ТипПартии,ДополнительныеПараметры) Экспорт
	
	Если ТипПартии = Неопределено Тогда Иначе  
		МассивПартий = ЗавершитьСборкуПаллетНаСервере(ТипПартии);
		ВыполнитьПечатьУпаковочныхЛистов(МассивПартий);          
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецФункции // ЗавершитьСборкуПаллет()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПараметрКоманды") Тогда  
		Если ЗначениеЗаполнено(Параметры.ПараметрКоманды.Ссылка) Тогда
			Объект.Распоряжение = Параметры.ПараметрКоманды;
			РаспоряжениеПриИзмененииНаСервере();
		Иначе     
			Отказ = Истина;
			ВызватьИсключение "Документ должен быть записан перед этой операцией!";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПечатьУпаковочныхЛистов(МассивПаллет)
	
	Результат = Новый ТабличныйДокумент; 
	Результат.АвтоМасштаб = Истина;
	Результат.ПолеСверху = 0;
	Результат.ПолеСлева  = 0;
	Результат.ПолеСнизу  = 0;
	Результат.ПолеСправа = 0;

	
	Для каждого Паллета Из МассивПаллет Цикл
	
		ТабличныйДокумент = СоздатьТабличныйДокументЭтикеткиПаллеты(Паллета);
		ВывестиТабличныйДокументЭтикеткиПаллеты(Результат,ТабличныйДокумент);
			
	КонецЦикла;  
	
	Результат.Показать("Паллеты");
	
КонецФункции // ВыполнитьПечатьУпаковочныхЛистов()

Функция СоздатьТабличныйДокументЭтикеткиПаллеты(Паллета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	//ТабличныйДокумент.ШиринаСтраницы = Ширина;
	//ТабличныйДокумент.ВысотаСтраницы = Высота;
	ТабличныйДокумент.РазмерСтраницы = "Custom";

	ТабличныйДокумент.Очистить();
	
	Макет = ПолучитьОбщийМакет("МакетШтрихкода");
	
	Область = Макет.ПолучитьОбласть("ОбластьШтрихкод|ШиринаЭтикетки");
	Рисунок = Область.Рисунки.ШтрихКод;
	
	Эталон = ПолучитьОбщийМакет("Эталон");
	
	КоличествоМиллиметровВПикселеВысота = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	КоличествоМиллиметровВПикселеШирина = Эталон.Рисунки.Квадрат100Пикселей.Ширина / 100;
	ШиринаШтрихкода = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселеШирина);
	ВысотаШтрихкода = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселеВысота * 1.5);
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",ШиринаШтрихкода);
	ПараметрыШтрихкода.Вставить("Высота",ВысотаШтрихкода);
	ПараметрыШтрихкода.Вставить("Штрихкод",        Паллета.Штрихкод);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("ТипКода",99);
		
	// ТУ Алфимов 01.03.2024++
	//Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	Рисунок.Картинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
	// ТУ Алфимов 01.03.2024--
	
	Рисунок.Расположить(Область.Область());
	ТабличныйДокумент.Вывести(Область); 
	
	Область = Макет.ПолучитьОбласть("ОбластьПредставлениеКода|ШиринаЭтикетки");
	Область.Параметры.ПредставлениеКода = Паллета.Наименование + Символы.ПС + "Дата:" + Формат(Паллета.ДатаПартии, "ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(Область);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ()

Функция ВывестиТабличныйДокументЭтикеткиПаллеты(Результат,ТабличныйДокумент)

	Результат.Вывести(ТабличныйДокумент);
	Возврат Результат;

КонецФункции // ВывестиТабличныйДокументЭтикеткиПаллеты()


&НаСервере
Функция ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, ЗначШтрихкод, ЗначТипШтрихкода)
	
	ПараметрыШтрихкода = МенеджерОборудованияКлиентСервер.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина = ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота = ВысотаШтрихкода;
	ПараметрыШтрихкода.ТипКода = ЗначТипШтрихкода;
	ПараметрыШтрихкода.Штрихкод = ЗначШтрихкод;
	ПараметрыШтрихкода.ПрозрачныйФон = Истина;
	//ПараметрыШтрихкода.УровеньКоррекцииQR = 2;
	ПараметрыШтрихкода.ОтображатьТекст = Ложь;
	//ПараметрыШтрихкода.Масштабировать = Истина;
	//ПараметрыШтрихкода.СохранятьПропорции = Истина;
	//ПараметрыШтрихкода.ВертикальноеВыравнивание  = 0; 
	//ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = 1;
	//ПараметрыШтрихкода.ТипВходныхДанных = 0;
	
	// ТУ Алфимов 01.03.2024++
	//РезультатКартинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	РезультатКартинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
	// ТУ Алфимов 01.03.2024-
	
	Возврат РезультатКартинка;
	
КонецФункции
